const breeds = [
   "Австралійська вівчарка", "Акіта", "Алабай", "Аляскинський маламут", "Англійський бульдог", "Англійський кокер-спанієль", "Англійський сетер", "Афганський хорт", "Басенджі", "Бассет-хаунд", "Бедлінгтон-тер'єр", "Бельгійська вівчарка", "Бернський зенненхунд", "Бігль", "Бішон фрізе", "Боксер", "Бордер-колі", "Бостон-тер'єр", "Бріард", "Бульдог", "Бульмастиф", "Бультер'єр", "Веймаранер", "Вельш-коргі пемброк", "Вест-хайленд-уайт-тер'єр", "Гаванський бішон", "Гладкошерста такса", "Гончак", "Грейгаунд", "Далматин", "Джек-Рассел тер'єр", "Доберман", "Дратхаар", "Естонський гончак", "Жесткошерстий фокстер'єр", "Західносибірська лайка", "Золотистий ретривер", "Ірландський сетер", "Ірландський вовкодав", "Йоркширський тер'єр", "Кавалер Кінг Чарльз спанієль", "Кане корсо", "Китайська чубата собака", "Кокер-спанієль", "Коллі", "Курцхаар", "Лабрадор ретривер", "Левретка", "Мальтійська болонка", "Мальтіпу", "Мастиф", "Міттельшнауцер", "Мініатюрний шнауцер", "Мопс", "Московська сторожова собака", "Німецька вівчарка", "Німецький боксер", "Німецький дог", "Німецький шпіц", "Ньюфаундленд", "Папільон", "Пекінес", "Пітбуль", "Пітбультер'єр", "Пойнтер", "Померанський шпіц", "Празький крисарик", "Пудель", "Ротвейлер", "Російський той-тер'єр", "Російський чорний тер'єр", "Салюкі", "Самоїдська собака", "Сенбернар", "Сибірський хаскі", "Сіба-іну", "Східноєвропейська вівчарка", "Східносибірська лайка", "Такса", "Тибетський мастиф", "Той тер'єр", "Угорська вижла", "Фокстер'єр", "Французький бульдог", "Ховаварт", "Чау-чау", "Чехословацький влчак", "Чихуахуа", "Шарпей", "Шелті", "Шипперке", "Шнауцер", "Шотландський тер'єр", "Шпіц", "Ягдтер'єр", "Японський хін", "Японський тер'єр", "Ягдтер'єр", "Японський хін", "Японський шпіц"
  ];
  
  document.addEventListener("DOMContentLoaded", () => {
    const breedSelect = document.getElementById("breed-select");
    if (!breedSelect) return;
  
    breeds.forEach(breed => {
      const option = document.createElement("option");
      option.value = breed;
      option.textContent = breed;
      breedSelect.appendChild(option);
    });
  });
  