const cities = [
    "Авдіївка", "Ананьїв", "Андрушівка", "Апостолове", "Арциз", "Балаклія", "Балта", "Бар", "Баранівка", "Барвінкове",
"Батурин", "Бахмач", "Бахмут", "Баштанка", "Бережани", "Бердичів", "Берегове", "Березань", "Березівка", "Берестечко",
"Берислав", "Бершадь", "Бібрка", "Біла Церква", "Білгород-Дністровський", "Білицьке", "Білопілля", "Бобровиця", "Бобринець",
"Богодухів", "Богуслав", "Болград", "Болехів", "Борзна", "Борислав", "Бориспіль", "Борщів", "Боярка", "Бровари", "Броди",
"Буринь", "Бурштин", "Буськ", "Буча", "Бучач", "Валки", "Вараш", "Васильків", "Ватутіне", "Вашківці", "Верхівцеве",
"Верхньодніпровськ", "Вижниця", "Вилкове", "Винники", "Виноградів", "Вишгород", "Вишневе", "Вільногірськ", "Вільнянськ",
"Вінниця", "Вовчанськ", "Вознесенськ", "Волноваха", "Володимир", "Волочиськ", "Ворожба", "Вугледар", "Гадяч", "Гайворон",
"Гайсин", "Галич", "Генічеськ", "Герца", "Глиняни", "Глобине", "Глухів", "Гнівань", "Гола Пристань", "Горішні Плавні",
"Городенка", "Городище", "Городня", "Городок", "Гостомель", "Гребінка", "Гуляйполе", "Дебальцеве", "Деражня", "Дергачі",
"Дніпро", "Дніпрорудне", "Добромиль", "Добропілля", "Долина", "Долинська", "Драбів", "Дрогобич", "Дружба", "Дружківка",
"Дубляни", "Дубно", "Дубровиця", "Енергодар", "Жашків", "Житомир", "Жмеринка", "Жовква", "Жовті Води", "Заводське",
"Заліщики", "Запоріжжя", "Заставна", "Зборів", "Звенигородка", "Здолбунів", "Зеленодольськ", "Знам'янка", "Золотоноша",
"Золочів", "Івано-Франківськ", "Ізмаїл", "Ізюм", "Ізяслав", "Іллінці", "Ірпінь", "Іршава", "Ічня", "Кагарлик", "Калинівка",
"Калуш", "Камінь-Каширський", "Кам'янець-Подільський", "Кам'янка", "Кам'янка-Бузька", "Кам'янське", "Канева", "Карлівка",
"Каховка", "Київ", "Кілія", "Кіптів", "Ківерці", "Кіцмань", "Кобеляки", "Ковель", "Кодима", "Козелець", "Козельщина",
"Козятин", "Коломия", "Комарно", "Компаніївка", "Конотоп", "Копичинці", "Корець", "Коростень", "Коростишів", "Корсунь-Шевченківський",
"Корюківка", "Косів", "Костопіль", "Краматорськ", "Красилів", "Кременець", "Кременчук", "Кривий Ріг", "Кропивницький",
"Куп'янськ", "Ладижин", "Ланівці", "Лебедин", "Липовець", "Лозова", "Лохвиця", "Лубни", "Луцьк", "Львів", "Мала Виска",
"Марганець", "Миргород", "Миколаїв", "Мелітополь", "Мена", "Мерефа", "Миколаївка", "Миронівка", "Могилів-Подільський",
"Монастириська", "Монастирище", "Мостиська", "Мукачево", "Надвірна", "Немирів", "Нетішин", "Ніжин", "Нікополь", "Нова Каховка",
"Нова Одеса", "Новгород-Сіверський", "Новий Буг", "Новий Розділ", "Нововолинськ", "Новомиргород", "Новоселиця",
"Новоукраїнка", "Новояворівськ", "Обухів", "Овруч", "Одеса", "Олевськ", "Олександрія", "Олександрівськ", "Олешки",
"Оріхів", "Острог", "Павлоград", "Первомайськ", "Первомайський", "Перемишляни", "Перечин", "Переяслав", "Підгайці",
"Пирятин", "Покров", "Покровськ", "Пологи", "Полонне", "Полтава", "Помічна", "Пустомити", "Путивль", "Путила",
"Радехів", "Радомишль", "Рахів", "Рені", "Рівне", "Рогатин", "Рожище", "Ромни", "Рубіжне", "Сарни", "Свалява", "Світловодськ",
"Святогірськ", "Севастополь", "Селидове", "Самбір", "Синельникове", "Скадовськ", "Сколе", "Сміла", "Снігурівка", "Сновськ",
"Снятин", "Сокаль", "Сокиряни", "Соледар", "Соснівка", "Старий Самбір", "Стебник", "Сторожинець", "Стрий", "Судак", "Суми",
"Тальне", "Тараща", "Татарбунари", "Теплодар", "Теребовля", "Тернівка", "Тернопіль", "Тетіїв", "Тисмениця", "Тлумач", "Токмак",
"Торецьк", "Тростянець", "Трускавець", "Тульчин", "Турка", "Тячів", "Ужгород", "Умань", "Фастів", "Харків", "Херсон",
"Хмельницький", "Хорол", "Хотин", "Христинівка", "Хуст", "Царичанка", "Червоноград", "Черкаси", "Чернівці", "Чернігів",
"Чигирин", "Чорноморськ", "Чортків", "Шаргород", "Шахтарськ", "Шепетівка", "Шостка", "Шпола", "Щастя", "Южноукраїнськ", "Яворів", "Яготин", "Ямпіль", "Яремче"

  ];
  
  document.addEventListener("DOMContentLoaded", () => {
    const citySelect = document.getElementById("city-select");
    if (!citySelect) return;
  
    cities.forEach(breed => {
      const option = document.createElement("option");
      option.value = breed;
      option.textContent = breed;
      citySelect.appendChild(option);
    });
  });